{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Qwen2ForSequenceClassification",
    "parent_library": "transformers.models.qwen2.modeling_qwen2"
  },
  "base_model_name_or_path": "../model/Qwen2.5-7B-Instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "c_attn",
    "v_proj",
    "q_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}